Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: الذين ينفقون في السراء والضراء والكاظمين الغيظ والعافين عن الناس والله يحب المحسنين
en: Those who spend (in Allah's Cause) in prosperity and in adversity , who repress anger , and who pardon men; verily, Allah loves Al-Muhsinun (the good-doers).

source: والذين إذا فعلوا فاحشة أو ظلموا أنفسهم ذكروا الله فاستغفروا لذنوبهم ومن يغفر الذنوب إلا الله ولم يصروا على ما فعلوا وهم يعلمون
en: And those who, when they have committed Fahishah (illegal sexual intercourse) or wronged themselves with evil, remember Allah and ask forgiveness for their sins; - and none can forgive sins but Allah - and do not persist in what (wrong) they have done, while they know.

source: أولئك جزاؤهم مغفرة من ربهم وجنات تجري من تحتها الأنهار خالدين فيها ونعم أجر العاملين
en: For such, the reward is Forgiveness from their Lord, and Gardens with rivers flowing underneath (Paradise), wherein they shall abide forever. How excellent is this reward for the doers (who do righteous deeds according to Allah's Orders).

source: قد خلت من قبلكم سنن فسيروا في الأرض فانظروا كيف كان عاقبة المكذبين
en: Many similar ways (and mishaps of life) were faced by nations (believers and disbelievers) that have passed away before you (as you have faced in the battle of Uhud), so travel through the earth, and see what was the end of those who disbelieved (in the Oneness of Allah, and disobeyed Him and His Messengers).

source: هذا بيان للناس وهدى وموعظة للمتقين
en: This (the Qur'an) is a plain statement for mankind, a guidance and instruction to those who are Al-Muttaqun (the pious - See V.2:2).

source: ولا تهنوا ولا تحزنوا وأنتم الأعلون إن كنتم مؤمنين
en: So do not become weak (against your enemy), nor be sad, and you will be superior (in victory) if you are indeed (true) believers.

source: إن يمسسكم قرح فقد مس القوم قرح مثله وتلك الأيام نداولها بين الناس وليعلم الله الذين آمنوا ويتخذ منكم شهداء والله لا يحب الظالمين
en: If a wound (and killing) has touched you, be sure a similar wound (and killing) has touched the others. And so are the days (good and not so good), We give to men by turns, that Allah may test those who believe, and that He may take martyrs from among you. And Allah likes not the Zalimun (polytheists and wrong-doers).

source: وليمحص الله الذين آمنوا ويمحق الكافرين
en: And that Allah may test (or purify) the believers (from sins) and destroy the disbelievers.

source: أم حسبتم أن تدخلوا الجنة ولما يعلم الله الذين جاهدوا منكم ويعلم الصابرين
en: Do you think that you will enter Paradise before Allah tests those of you who fought (in His Cause) and (also) tests those who are As-Sabirun (the patient)?

source: ولقد كنتم تمنون الموت من قبل أن تلقوه فقد رأيتموه وأنتم تنظرون
en: You did indeed wish for death (Ash-Shahadah - martyrdom) before you met it. Now you have seen it openly with your own eyes.

source: وما محمد إلا رسول قد خلت من قبله الرسل أفإن مات أو قتل انقلبتم على أعقابكم ومن ينقلب على عقبيه فلن يضر الله شيئا وسيجزي الله الشاكرين
en: Muhammad (صلى الله عليه وسلم) is no more than a Messenger, and indeed (many) Messengers have passed away before him. If he dies or is killed, will you then turn back on your heels (as disbelievers)? And he who turns back on his heels, not the least harm will he do to Allah; and Allah will give reward to those who are grateful.

source: وما كان لنفس أن تموت إلا بإذن الله كتابا مؤجلا ومن يرد ثواب الدنيا نؤته منها ومن يرد ثواب الآخرة نؤته منها وسنجزي الشاكرين
en: And no person can ever die except by Allah's Leave and at an appointed term. And whoever desires a reward in (this) world, We shall give him of it; and whoever desires a reward in the Hereafter, We shall give him thereof. And We shall reward the grateful.

source: وكأين من نبي قاتل معه ربيون كثير فما وهنوا لما أصابهم في سبيل الله وما ضعفوا وما استكانوا والله يحب الصابرين
en: And many a Prophet (i.e. many from amongst the Prophets) fought (in Allah's Cause) and along with him (fought) large bands of religious learned men. But they never lost heart for that which did befall them in Allah's Way, nor did they weaken nor degrade themselves. And Allah loves As-Sabirun (the patient).

source: وما كان قولهم إلا أن قالوا ربنا اغفر لنا ذنوبنا وإسرافنا في أمرنا وثبت أقدامنا وانصرنا على القوم الكافرين
en: And they said nothing but: "Our Lord! Forgive us our sins and our transgressions (in keeping our duties to You), establish our feet firmly, and give us victory over the disbelieving folk."

source: فآتاهم الله ثواب الدنيا وحسن ثواب الآخرة والله يحب المحسنين
en: So Allah gave them the reward of this world, and the excellent reward of the Hereafter. And Allah loves Al-Muhsinun (the good-doers - See the footnote of V.3:134 and of V.9:120).

source: يا أيها الذين آمنوا إن تطيعوا الذين كفروا يردوكم على أعقابكم فتنقلبوا خاسرين
en: O you who believe! If you obey those who disbelieve, they will send you back on your heels, and you will turn back (from Faith) as losers.

source: بل الله مولاكم وهو خير الناصرين
en: Nay, Allah is your Maula (Patron, Lord, Helper, Protector), and He is the Best of helpers.

source: سنلقي في قلوب الذين كفروا الرعب بما أشركوا بالله ما لم ينزل به سلطانا ومأواهم النار وبئس مثوى الظالمين
en: We shall cast terror into the hearts of those who disbelieve, because they joined others in worship with Allah, for which He had sent no authority; their abode will be the Fire and how evil is the abode of the Zalimun (polytheists and wrong-doers).

source: ولقد صدقكم الله وعده إذ تحسونهم بإذنه حتى إذا فشلتم وتنازعتم في الأمر وعصيتم من بعد ما أراكم ما تحبون منكم من يريد الدنيا ومنكم من يريد الآخرة ثم صرفكم عنهم ليبتليكم ولقد عفا عنكم والله ذو فضل على المؤمنين
en: And Allah did indeed fulfil His Promise to you when you were killing them (your enemy) with His Permission; until (the moment) you lost your courage and fell to disputing about the order, and disobeyed after He showed you (of the booty) which you love. Among you are some that desire this world and some that desire the Hereafter. Then He made you flee from them (your enemy), that He might test you. But surely, He forgave you, and Allah is Most Gracious to the believers.

source: إذ تصعدون ولا تلوون على أحد والرسول يدعوكم في أخراكم فأثابكم غما بغم لكيلا تحزنوا على ما فاتكم ولا ما أصابكم والله خبير بما تعملون
en: (And remember) when you ran away (dreadfully) without even casting a side glance at anyone, and the Messenger (Muhammad صلى الله عليه وسلم) was in your rear calling you back. There did Allah give you one distress after another by way of requital to teach you not to grieve for that which had escaped you, nor for that which had befallen you. And Allah is Well-Aware of all that you do.

source: ثم أنزل عليكم من بعد الغم أمنة نعاسا يغشى طائفة منكم وطائفة قد أهمتهم أنفسهم يظنون بالله غير الحق ظن الجاهلية يقولون هل لنا من الأمر من شيء قل إن الأمر كله لله يخفون في أنفسهم ما لا يبدون لك يقولون لو كان لنا من الأمر شيء ما قتلنا هاهنا قل لو كنتم في بيوتكم لبرز الذين كتب عليهم القتل إلى مضاجعهم وليبتلي الله ما في صدوركم وليمحص ما في قلوبكم والله عليم بذات الصدور
en: Then after the distress, He sent down security for you. Slumber overtook a party of you, while another party was thinking about themselves (as how to save their ownselves, ignoring the others and the Prophet صلى الله عليه وسلم) and thought wrongly of Allah - the thought of ignorance. They said, "Have we any part in the affair?" Say (O Muhammad صلى الله عليه وسلم): "Indeed the affair belongs wholly to Allah." They hide within themselves what they dare not reveal to you, saying: "If we had anything to do with the affair, none of us would have been killed here." Say: "Even if you had remained in your homes, those for whom death was decreed would certainly have gone forth to the place of their death," but that Allah might test what is in your breasts; and to purify that which was in your hearts (sins), and Allah is All-Knower of what is in (your) breasts.

source: إن الذين تولوا منكم يوم التقى الجمعان إنما استزلهم الشيطان ببعض ما كسبوا ولقد عفا الله عنهم إن الله غفور حليم
en: Those of you who turned back on the day the two hosts met (i.e. the battle of Uhud), it was Shaitan (Satan) who caused them to backslide (run away from the battlefield) because of some (sins) they had earned. But Allah, indeed, has forgiven them. Surely, Allah is Oft-Forgiving, Most Forbearing.

source: يا أيها الذين آمنوا لا تكونوا كالذين كفروا وقالوا لإخوانهم إذا ضربوا في الأرض أو كانوا غزى لو كانوا عندنا ما ماتوا وما قتلوا ليجعل الله ذلك حسرة في قلوبهم والله يحيي ويميت والله بما تعملون بصير
en: O you who believe! Be not like those who disbelieve (hypocrites) and who say to their brethren when they travel through the earth or go out to fight: "If they had stayed with us, they would not have died or been killed," so that Allah may make it a cause of regret in their hearts. It is Allah that gives life and causes death. And Allah is All-Seer of what you do.

source: ولئن قتلتم في سبيل الله أو متم لمغفرة من الله ورحمة خير مما يجمعون
en: And if you are killed or die in the Way of Allah, forgiveness and mercy from Allah are far better than all that they amass (of worldly wealths).

source: ولئن متم أو قتلتم لإلى الله تحشرون
en: And whether you die, or are killed, verily, unto Allah you shall be gathered.

source: فبما رحمة من الله لنت لهم ولو كنت فظا غليظ القلب لانفضوا من حولك فاعف عنهم واستغفر لهم وشاورهم في الأمر فإذا عزمت فتوكل على الله إن الله يحب المتوكلين
en: And by the Mercy of Allah, you dealt with them gently. And had you been severe and harsh-hearted, they would have broken away from about you; so pass over (their faults), and ask (Allah's) Forgiveness for them; and consult them in the affairs. Then when you have taken a decision, put your trust in Allah, certainly, Allah loves those who put their trust (in Him).

source: إن ينصركم الله فلا غالب لكم وإن يخذلكم فمن ذا الذي ينصركم من بعده وعلى الله فليتوكل المؤمنون
en: If Allah helps you, none can overcome you; and if He forsakes you, who is there after Him that can help you? And in Allah (Alone) let believers put their trust.

source: وما كان لنبي أن يغل ومن يغلل يأت بما غل يوم القيامة ثم توفى كل نفس ما كسبت وهم لا يظلمون
en: It is not for any Prophet to take illegally a part of booty (Ghulul ), and whosoever deceives his companions as regards the booty, he shall bring forth on the Day of Resurrection that which he took (illegally). Then every person shall be paid in full what he has earned, and they shall not be dealt with unjustly.

source: أفمن اتبع رضوان الله كمن باء بسخط من الله ومأواه جهنم وبئس المصير
en: Is then one who follows (seeks) the good Pleasure of Allah (by not taking illegally a part of the booty) like the one who draws on himself the Wrath of Allah (by taking a part of the booty illegally - Ghulul)? - his abode is Hell, and worst, indeed is that destination!

source: هم درجات عند الله والله بصير بما يعملون
en: They are in varying grades with Allah, and Allah is All-Seer of what they do.

source: لقد من الله على المؤمنين إذ بعث فيهم رسولا من أنفسهم يتلو عليهم آياته ويزكيهم ويعلمهم الكتاب والحكمة وإن كانوا من قبل لفي ضلال مبين
en: Indeed Allah conferred a great favour on the believers when He sent among them a Messenger (Muhammad صلى الله عليه وسلم) from among themselves, reciting unto them His Verses (the Qur'an), and purifying them (from sins by their following him), and instructing them (in) the Book (the Qur'an) and Al-Hikmah [the wisdom and the Sunnah of the Prophet صلى الله عليه وسلم (i.e. his legal ways, statements, acts of worship)], while before that they had been in manifest error.

source: أولما أصابتكم مصيبة قد أصبتم مثليها قلتم أنى هذا قل هو من عند أنفسكم إن الله على كل شيء قدير
en: (What is the matter with you?) When a single disaster smites you, although you smote (your enemies) with one twice as great, you say: "From where does this come to us?" Say (to them), "It is from yourselves (because of your evil deeds)." And Allah has power over all things.

source: وما أصابكم يوم التقى الجمعان فبإذن الله وليعلم المؤمنين
en: And what you suffered (of the disaster) on the day (of the battle of Uhud when) the two armies met, was by the leave of Allah, in order that He might test the believers.

source: وليعلم الذين نافقوا وقيل لهم تعالوا قاتلوا في سبيل الله أو ادفعوا قالوا لو نعلم قتالا لاتبعناكم هم للكفر يومئذ أقرب منهم للإيمان يقولون بأفواههم ما ليس في قلوبهم والله أعلم بما يكتمون
en: And that He might test the hypocrites, it was said to them: "Come, fight in the Way of Allah or (at least) defend yourselves." They said: "Had we known that fighting will take place, we would certainly have followed you." They were that day, nearer to disbelief than to Faith, saying with their mouths what was not in their hearts. And Allah has full knowledge of what they conceal.

source: الذين قالوا لإخوانهم وقعدوا لو أطاعونا ما قتلوا قل فادرءوا عن أنفسكم الموت إن كنتم صادقين
en: (They are) the ones who said about their killed brethren while they themselves sat (at home): "If only they had listened to us, they would not have been killed." Say: "Avert death from your ownselves, if you speak the truth."

source: ولا تحسبن الذين قتلوا في سبيل الله أمواتا بل أحياء عند ربهم يرزقون
en: Think not of those who are killed in the Way of Allah as dead. Nay, they are alive, with their Lord, and they have provision.

source: فرحين بما آتاهم الله من فضله ويستبشرون بالذين لم يلحقوا بهم من خلفهم ألا خوف عليهم ولا هم يحزنون
en: They rejoice in what Allah has bestowed upon them of His Bounty and rejoice for the sake of those who have not yet joined them, but are left behind (not yet martyred) that on them no fear shall come, nor shall they grieve.

source: يستبشرون بنعمة من الله وفضل وأن الله لا يضيع أجر المؤمنين
en: They rejoice in a Grace and a Bounty from Allah, and that Allah will not waste the reward of the believers.

source: الذين استجابوا لله والرسول من بعد ما أصابهم القرح للذين أحسنوا منهم واتقوا أجر عظيم
en: Those who answered (the Call of) Allah and the Messenger (Muhammad صلى الله عليه وسلم) after being wounded; for those of them who did good deeds and feared Allah, there is a great reward.

source: الذين قال لهم الناس إن الناس قد جمعوا لكم فاخشوهم فزادهم إيمانا وقالوا حسبنا الله ونعم الوكيل
en: Those (i.e. believers) unto whom the people (hypocrites) said, "Verily, the people (pagans) have gathered against you (a great army), therefore, fear them." But it (only) increased them in Faith, and they said: "Allah (Alone) is Sufficient for us, and He is the Best Disposer of affairs (for us). "

source: فانقلبوا بنعمة من الله وفضل لم يمسسهم سوء واتبعوا رضوان الله والله ذو فضل عظيم
en: So they returned with Grace and Bounty from Allah. No harm touched them; and they followed the good Pleasure of Allah. And Allah is the Owner of Great Bounty.

source: إنما ذلكم الشيطان يخوف أولياءه فلا تخافوهم وخافون إن كنتم مؤمنين
en: It is only Shaitan (Satan) that suggests to you the fear of his Auliya' [supporters and friends (polytheists, disbelievers in the Oneness of Allah and in His Messenger, Muhammad صلى الله عليه وسلم)]; so fear them not, but fear Me, if you are (true) believers.

source: ولا يحزنك الذين يسارعون في الكفر إنهم لن يضروا الله شيئا يريد الله ألا يجعل لهم حظا في الآخرة ولهم عذاب عظيم
en: And let not those grieve you (O Muhammad صلى الله عليه وسلم) who rush with haste to disbelieve; verily, not the least harm will they do to Allah. It is Allah's Will to give them no portion in the Hereafter. For them there is a great torment.

source: إن الذين اشتروا الكفر بالإيمان لن يضروا الله شيئا ولهم عذاب أليم
en: Verily, those who purchase disbelief at the price of Faith, not the least harm will they do to Allah. For them, there is a painful torment.

source: ولا يحسبن الذين كفروا أنما نملي لهم خير لأنفسهم إنما نملي لهم ليزدادوا إثما ولهم عذاب مهين
en: And let not the disbelievers think that Our postponing of their punishment is good for them. We postpone the punishment only so that they may increase in sinfulness. And for them is a disgracing torment.

source: ما كان الله ليذر المؤمنين على ما أنتم عليه حتى يميز الخبيث من الطيب وما كان الله ليطلعكم على الغيب ولكن الله يجتبي من رسله من يشاء فآمنوا بالله ورسله وإن تؤمنوا وتتقوا فلكم أجر عظيم
en: Allah will not leave the believers in the state in which you are now, until He distinguishes the wicked from the good. Nor will Allah disclose to you the secrets of the Ghaib (unseen), but Allah chooses of His Messengers whom He wills. So believe in Allah and His Messengers. And if you believe and fear Allah, then for you there is a great reward.

source: ولا يحسبن الذين يبخلون بما آتاهم الله من فضله هو خيرا لهم بل هو شر لهم سيطوقون ما بخلوا به يوم القيامة ولله ميراث السماوات والأرض والله بما تعملون خبير
en: And let not those who covetously withhold of that which Allah has bestowed on them of His Bounty (Wealth) think that it is good for them (and so they do not pay the obligatory Zakat ). Nay, it will be worse for them; the things which they covetously withheld shall be tied to their necks like a collar on the Day of Resurrection . And to Allah belongs the heritage of the heavens and the earth; and Allah is Well-Acquainted with all that you do.

source: لقد سمع الله قول الذين قالوا إن الله فقير ونحن أغنياء سنكتب ما قالوا وقتلهم الأنبياء بغير حق ونقول ذوقوا عذاب الحريق
en: Indeed, Allah has heard the statement of those (Jews) who say: "Truly, Allah is poor and we are rich!" We shall record what they have said and their killing of the Prophets unjustly, and We shall say: "Taste you the torment of the burning (Fire)."

source: ذلك بما قدمت أيديكم وأن الله ليس بظلام للعبيد
en: This is because of that (evil) which your hands have sent before you. And certainly, Allah is never unjust to (His) slaves.

source: الذين قالوا إن الله عهد إلينا ألا نؤمن لرسول حتى يأتينا بقربان تأكله النار قل قد جاءكم رسل من قبلي بالبينات وبالذي قلتم فلم قتلتموهم إن كنتم صادقين
en: Those (Jews) who said: "Verily, Allah has taken our promise not to believe in any Messenger unless he brings to us an offering which the fire (from heaven) shall devour." Say: "Verily, there came to you Messengers before me, with clear signs and even with what you speak of; why then did you kill them, if you are truthful?"

source: فإن كذبوك فقد كذب رسل من قبلك جاءوا بالبينات والزبر والكتاب المنير
en: Then if they reject you (O Muhammad صلى الله عليه وسلم), so were Messengers rejected before you, who came with Al-Bayyinat (clear signs, proofs, evidence) and the Scripture and the Book of Enlightenment.

source: كل نفس ذائقة الموت وإنما توفون أجوركم يوم القيامة فمن زحزح عن النار وأدخل الجنة فقد فاز وما الحياة الدنيا إلا متاع الغرور
en: Everyone shall taste death. And only on the Day of Resurrection shall you be paid your wages in full. And whoever is removed away from the Fire and admitted to Paradise, he indeed is successful. The life of this world is only the enjoyment of deception (a deceiving thing).

source: لتبلون في أموالكم وأنفسكم ولتسمعن من الذين أوتوا الكتاب من قبلكم ومن الذين أشركوا أذى كثيرا وإن تصبروا وتتقوا فإن ذلك من عزم الأمور
en: You shall certainly be tried and tested in your wealth and properties and in your personal selves, and you shall certainly hear much that will grieve you from those who received the Scripture before you (Jews and Christians) and from those who ascribe partners to Allah; but if you persevere patiently, and become Al-Muttaqun (the pious - See V.2:2) then verily, that will be a determining factor in all affairs (and that is from the great matters which you must hold on with all your efforts).

source: وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه فنبذوه وراء ظهورهم واشتروا به ثمنا قليلا فبئس ما يشترون
en: (And remember) when Allah took a covenant from those who were given the Scripture (Jews and Christians) to make it (the news of the coming of Prophet Muhammad صلى الله عليه وسلم and the religious knowledge) known and clear to mankind, and not to hide it, but they threw it away behind their backs, and purchased with it some miserable gain! And indeed worst is that which they bought.

source: لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا فلا تحسبنهم بمفازة من العذاب ولهم عذاب أليم
en: Think not that those who rejoice in what they have done (or brought about), and love to be praised for what they have not done, - think not you that they are rescued from the torment, and for them is a painful torment.

source: ولله ملك السماوات والأرض والله على كل شيء قدير
en: And to Allah belongs the dominion of the heavens and the earth, and Allah has power over all things.

source: إن في خلق السماوات والأرض واختلاف الليل والنهار لآيات لأولي الألباب
en: Verily! In the creation of the heavens and the earth, and in the alternation of night and day, there are indeed signs for men of understanding.

source: الذين يذكرون الله قياما وقعودا وعلى جنوبهم ويتفكرون في خلق السماوات والأرض ربنا ما خلقت هذا باطلا سبحانك فقنا عذاب النار
en: Those who remember Allah (always, and in prayers) standing, sitting, and lying down on their sides, and think deeply about the creation of the heavens and the earth, (saying): "Our Lord! You have not created (all) this without purpose, glory to You! (Exalted are You above all that they associate with You as partners). Give us salvation from the torment of the Fire.

source: ربنا إنك من تدخل النار فقد أخزيته وما للظالمين من أنصار
en: "Our Lord! Verily, whom You admit to the Fire, indeed, You have disgraced him; and never will the Zalimun (polytheists and wrong-doers) find any helpers.

source: ربنا إننا سمعنا مناديا ينادي للإيمان أن آمنوا بربكم فآمنا ربنا فاغفر لنا ذنوبنا وكفر عنا سيئاتنا وتوفنا مع الأبرار
en: "Our Lord! Verily, we have heard the call of one (Muhammad صلى الله عليه وسلم) calling to Faith: 'Believe in your Lord,' and we have believed. Our Lord! Forgive us our sins and expiate from us our evil deeds, and make us die (in the state of righteousness) along with Al-Abrar (the pious believers of Islamic Monotheism).

source: ربنا وآتنا ما وعدتنا على رسلك ولا تخزنا يوم القيامة إنك لا تخلف الميعاد
en: "Our Lord! Grant us what You promised unto us through Your Messengers and disgrace us not on the Day of Resurrection, for You never break (Your) Promise."

source: فاستجاب لهم ربهم أني لا أضيع عمل عامل منكم من ذكر أو أنثى بعضكم من بعض فالذين هاجروا وأخرجوا من ديارهم وأوذوا في سبيلي وقاتلوا وقتلوا لأكفرن عنهم سيئاتهم ولأدخلنهم جنات تجري من تحتها الأنهار ثوابا من عند الله والله عنده حسن الثواب
en: So their Lord accepted of them (their supplication and answered them), "Never will I allow to be lost the work of any of you, be he male or female. You are (members) one of another, so those who emigrated and were driven out from their homes, and suffered harm in My Cause, and who fought, and were killed (in My Cause), verily, I will expiate from them their evil deeds and admit them into Gardens under which rivers flow (in Paradise); a reward from Allah, and with Allah is the best of rewards."

source: لا يغرنك تقلب الذين كفروا في البلاد
en: Let not the free disposal (and affluence) of the disbelievers throughout the land deceive you.

source: متاع قليل ثم مأواهم جهنم وبئس المهاد
en: A brief enjoyment; then, their ultimate abode is Hell; and worst indeed is that place for rest.

source: لكن الذين اتقوا ربهم لهم جنات تجري من تحتها الأنهار خالدين فيها نزلا من عند الله وما عند الله خير للأبرار
en: But, for those who fear their Lord, are Gardens under which rivers flow (in Paradise); therein are they to dwell (for ever), an entertainment from Allah; and that which is with Allah is the Best for Al-Abrar (the pious believers of Islamic Monotheism).
